app/views/blogs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."blog_id" = ? ORDER BY "posts"."publish_date" DESC  [["blog_id", 1]]
---

<% @blog.posts.order(publish_date: :desc).each do |post| %>