app/views/posts/index.html.erb

        <td><%= link_to post.blog.title, post.blog %></td>
        <td><%= post.user.first_name %> <%= post.user.last_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]