app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = session[:user_id]

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "description", "public", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)