app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.blog_id = @blog.id
    @post.user_id = session[:user_id]

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "public", "publish_date", "blog_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ABOUT"], ["body", "This is the about page"], ["updated_at", "2017-08-15 04:43:17.226720"], ["id", 1]]

    def set_blog
      @blog = Blog.find(params[:blog_id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_post
      # @post = Post.find(params[:id])
      @post = @blog.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]