app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email_primary", "email_secondary", "phone_mobile", "first_name", "middle_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save